[
  {
    "id": 1,
    "name": "Спайдер мэн",
    "description": "Питер Паркер возвращается к жизни школьника, но сталкивается со Стервятником. С помощью Тони Старка он учится быть героем.",
    "href": "movies/spiderMan/",
    "poster": "/images/films/spiderMan/image.png",
    "fulldescription": "Питер Паркер, вернувшийся к обычной жизни школьника после грандиозных событий с Мстителями, пытается совмещать учёбу, личную жизнь и роль супергероя. Однако когда появляется новый злодей — Стервятник, угрожающий его городу, Питер понимает, что быть героем — значит принимать сложные решения. При поддержке Тони Старка он начинает понимать, что сила требует ответственности, и вступает в бой за справедливость.",
    "posterId": "sM"
  },
  {
    "id": 2,
    "name": "Интерстеллар",
    "description": "Купер и учёные летят через червоточину в поисках новой планеты, сталкиваясь с испытаниями времени и любви.",
    "href": "movies/interstellar",
    "poster": "/images/films/interstellar/image.png",
    "fulldescription": "Когда Земля становится непригодной для жизни, группа исследователей во главе с бывшим пилотом НАСА Купером отправляется через червоточину в другой галактике. Их цель — найти новую планету для человечества. По пути команда сталкивается с загадками времени, гравитации и человеческих чувств. Это история не только о космосе, но и о силе любви между отцом и дочерью, способной преодолеть любые расстояния.",
    "posterId": "in"
  },
  {
    "id": 3,
    "name": "Зеленая книга",
    "description": "Тони становится водителем чернокожего пианиста. На фоне расизма возникает дружба, меняющая их жизни.",
    "href": "movies/greenBook/",
    "poster": "/images/films/greenBook/image.png",
    "fulldescription": "Нью-йоркский вышибала Тони Валлелонга устраивается водителем к чернокожему пианисту Дону Ширли для гастролей по югу США в 1960-х годах. Их путешествие по расистским штатам становится настоящим испытанием для обоих, полным конфликтов, неожиданностей и глубоких разговоров. Постепенно между ними возникает уважение и крепкая дружба, изменяющая их взгляды на жизнь и самих себя.",
    "posterId": "gB"
  },
  {
    "id": 4,
    "name": "Форсаж 7",
    "description": "Доминик и команда противостоят брату врага. Их ждут погони, взрывы и прощание с Полом Уокером.",
    "href": "movies/FAF/",
    "poster": "/images/films/FAF/image.png",
    "fulldescription": "После победы над Оуэном Шоу Доминик Торетто и его команда вынуждены столкнуться с новым врагом — Деккардом Шоу, братом поверженного противника. Он мстит за семью и начинает охоту на всех членов команды. Героев ждут высокоскоростные погони, опасные миссии и трогательное прощание с Брайаном, символически завершающее одну из глав франшизы.",
    "posterId": "FF"
  },
  {
    "id": 5,
    "name": "Начало",
    "description": "Кобб крадёт секреты из подсознания во сне, но теперь ему предстоит внедрить идею в чужой разум.",
    "href": "movies/inception/",
    "poster": "/images/films/inception/image.png",
    "fulldescription": "Доминик Кобб — талантливый вор, способный проникать в сны и красть идеи. Однако его новое задание — не кража, а внедрение идеи в сознание. Это 'начало' может изменить мышление цели. Чтобы выполнить задачу, Коббу с командой придётся пройти через многослойные сны, где границы между реальностью и вымыслом стираются. А всё это — ради того, чтобы вернуться к детям и искупить прошлое.",
    "posterId": "st"
  },
  {
    "id": 6,
    "name": "Матрица",
    "description": "Хакер Нео узнаёт, что реальность — это иллюзия, и вступает в борьбу за освобождение человечества.",
    "href": "movies/matrix/",
    "poster": "/images/films/matrix/image.png",
    "fulldescription": "Программист Томас Андерсон, скрывающийся под псевдонимом Нео, обнаруживает, что его мир — это виртуальная иллюзия, созданная машинами для порабощения человечества. Он присоединяется к группе повстанцев, чтобы раскрыть правду и освободить людей. На его пути — выбор между ложью и реальностью, битва с агентами системы и собственное перерождение как Избранного.",
    "posterId": "ma"
  },
  {
    "id": 7,
    "name": "Темный рыцарь",
    "description": "Бэтмен сталкивается с Джокером, который сеет хаос в Готэме. Герою приходится идти на жертвы.",
    "href": "movies/darkKnight/",
    "poster": "/images/films/darkKnight/image.png",
    "fulldescription": "Бэтмен, комиссар Гордон и прокурор Харви Дент объединяют усилия, чтобы очистить Готэм от преступности. Однако появление безумного гения Джокера, стремящегося разрушить порядок и сеять хаос, ставит под угрозу всё, во что верят герои. Ради спасения города Брюсу Уэйну придётся пожертвовать своей репутацией и сделать трудный моральный выбор.",
    "posterId": "dK"
  },
  {
    "id": 8,
    "name": "Дюна",
    "description": "Пол Атрейдес оказывается втянут в борьбу за власть на пустынной планете с уникальным ресурсом.",
    "href": "movies/dune/",
    "poster": "/images/films/dune/image.png",
    "fulldescription": "Молодой Пол Атрейдес оказывается втянут в борьбу за контроль над пустынной планетой Арракис — единственным источником ценного ресурса под названием пряность. После предательства и гибели семьи, Пол уходит к местным жителям — фременам, где обретает новое предназначение. Ему предстоит стать мессией, чтобы изменить судьбу целой цивилизации и исполнить древние пророчества.",
    "posterId": "dn"
  },
  {
    "id": 9,
    "name": "Аватар",
    "description": "На Пандоре бывший морпех в теле аватара встаёт на сторону местных жителей в битве за их мир.",
    "href": "movies/avatar/",
    "poster": "/images/films/avatar/image.png",
    "fulldescription": "Ветеран Джейк Салли получает шанс начать новую жизнь на далёкой планете Пандора, управляя аватаром — телом, созданным для взаимодействия с местным народом на’ви. По мере общения с коренными жителями он проникается их культурой и становится одним из них. Когда корпорация Земли угрожает уничтожить Пандору ради ресурсов, Джейк встаёт на сторону на’ви в борьбе за их дом.",
    "posterId": "av"
  },
  {
    "id": 10,
    "name": "Гладиатор",
    "description": "Генерал Максимус становится рабом и гладиатором, чтобы отомстить за семью и восстановить справедливость.",
    "href": "movies/gladiator/",
    "poster": "/images/films/gladiator/image.png",
    "fulldescription": "Генерал Максимус, любимец императора, оказывается преданным, потерявшим семью и проданным в рабство. Став гладиатором, он поднимается от арены до самой вершины, чтобы отомстить узурпатору Коммоду, занявшему трон. История о чести, верности, силе духа и пути воина, который борется не только за себя, но и за справедливость.",
    "posterId": "gl"
  }
]
